# SKPImportOptions Constructor (SKPImportOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SKPImportOptions Constructor (SKPImportOptions)
SKPImportOptions Class See Also
---
Constructs a new instance of SKPImportOptions as a copy of the import options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public SKPImportOptions(
	SKPImportOptions option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As SKPImportOptions _
)
```

Visual C++
---
```text
public:
SKPImportOptions(
	SKPImportOptions^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..SKPImportOptions The SKP options to be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SKPImportOptions Class
SKPImportOptions Overload
Autodesk.Revit.DB Namespace